In [40]:
import numpy as np
import pandas as pd
sgs = pd.read_csv('super-grades.csv', index_col=0)
sgs

         Exam 1  Exam 2  Exam 3
Student
Thorny      100      90      80
Mac          88      99     111
Farva        45      56      67
Rabbit       59      61      67
Ursula       73      79      83
Foster       89      97     101

In [41]:
{stud: np.mean(sgs.loc[stud]) for stud in sgs.index}

{'Farva': 56.0,
 'Foster': 95.666666666666671,
 'Mac': 99.333333333333329,
 'Rabbit': 62.333333333333336,
 'Thorny': 90.0,
 'Ursula': 78.333333333333329}

In [42]:
avgs = pd.Series({stud: np.mean(sgs.loc[stud]) for stud in sgs.index})
avgs

Farva     56.000000
Foster    95.666667
Mac       99.333333
Rabbit    62.333333
Thorny    90.000000
Ursula    78.333333
dtype: float64

In [43]:
sgs['avg'] = avgs
sgs

         Exam 1  Exam 2  Exam 3        avg
Student
Thorny      100      90      80  90.000000
Mac          88      99     111  99.333333
Farva        45      56      67  56.000000
Rabbit       59      61      67  62.333333
Ursula       73      79      83  78.333333
Foster       89      97     101  95.666667

In [44]:
 np.mean(sgs['Exam 1'])

75.666666666666671

In [45]:
item_avgs = {col: {'Item Avg': np.mean(sgs[col])} for col in sgs.columns}
item_avgs

{'Exam 1': {'Item Avg': 75.666666666666671},
 'Exam 2': {'Item Avg': 80.333333333333329},
 'Exam 3': {'Item Avg': 84.833333333333329},
 'avg': {'Item Avg': 80.277777777777771}}

In [46]:
item_avgs_df = pd.DataFrame(item_avgs)
item_avgs_df

             Exam 1     Exam 2     Exam 3        avg
Item Avg  75.666667  80.333333  84.833333  80.277778

In [47]:
sgs = sgs.append(item_avgs_df)
sgs

              Exam 1     Exam 2      Exam 3        avg
Thorny    100.000000  90.000000   80.000000  90.000000
Mac        88.000000  99.000000  111.000000  99.333333
Farva      45.000000  56.000000   67.000000  56.000000
Rabbit     59.000000  61.000000   67.000000  62.333333
Ursula     73.000000  79.000000   83.000000  78.333333
Foster     89.000000  97.000000  101.000000  95.666667
Item Avg   75.666667  80.333333   84.833333  80.277778

In [48]:
sgs['Grade'] = np.where(sgs['avg'] >= 90, 'A',
                        np.where(sgs['avg'] >= 80, 'B',
                                 np.where(sgs['avg'] >= 70, 'C',
                                          np.where(sgs['avg'] >= 60, 'D',
                                                   'D'))))
sgs

              Exam 1     Exam 2      Exam 3        avg Grade
Thorny    100.000000  90.000000   80.000000  90.000000     A
Mac        88.000000  99.000000  111.000000  99.333333     A
Farva      45.000000  56.000000   67.000000  56.000000     D
Rabbit     59.000000  61.000000   67.000000  62.333333     D
Ursula     73.000000  79.000000   83.000000  78.333333     C
Foster     89.000000  97.000000  101.000000  95.666667     A
Item Avg   75.666667  80.333333   84.833333  80.277778     B

In [49]:
sgs['Grade'].groupby(sgs['Grade']).count()

Grade
A    3
B    1
C    1
D    2
Name: Grade, dtype: int64